app/controllers/hastags_controller.rb

  def index
    @hastags = Hastag.all
---
SELECT "hastags".* FROM "hastags"

  def create
    @hastag = Hastag.new(hastag_params)

    respond_to do |format|
      if @hastag.save
---
INSERT INTO "hastags" ("created_at", "etiqueta", "id_hastag", "intencion", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-12-13 14:08:09.283644"], ["etiqueta", "#AbortoLegal"], ["id_hastag", "1"], ["intencion", "proaborto"], ["updated_at", "2014-12-13 14:08:09.283644"]]

  def destroy
    @hastag.destroy
---
DELETE FROM "hastags" WHERE "hastags"."id" = $1  [["id", 2]]

    def set_hastag
      @hastag = Hastag.find(params[:id])
---
SELECT  "hastags".* FROM "hastags"  WHERE "hastags"."id" = $1 LIMIT 1  [["id", 2]]