app/controllers/usuarios_controller.rb

SELECT "usuarios".* FROM "usuarios"
---
  def index
    @usuarios = Usuario.all

DELETE FROM "usuarios" WHERE "usuarios"."id" = $1  [["id", 1]]
---
  def destroy
    @usuario.destroy

SELECT  "usuarios".* FROM "usuarios"  WHERE "usuarios"."id" = $1 LIMIT 1  [["id", 225]]
---
    def set_usuario
      @usuario = Usuario.find(params[:id])