app/controllers/welcome_controller.rb

INSERT INTO "tweets" ("created_at", "fecha", "id_tweet", "mensaje", "retweet_contador", "updated_at", "usuario_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
UPDATE "tweets" SET "updated_at" = $1, "usuario_id" = $2 WHERE "tweets"."id" = 55  [["updated_at", "2014-12-13 15:47:30.873763"], ["usuario_id", 2]]
---
def index
  	require 'twitter'
	client = Twitter::REST::Client.new do |config|
  		config.consumer_key        = "svmHMBBvtf5WSz8Jvu54Ouy23"
  		config.consumer_secret     = "z6HY0kZjuFsyNo8XLT0RXT6zwIQzorlcEkGjR8kfegHAAaUoMH"
  		config.access_token        = "2891572623-whlhrrDQbyVWbNimTZ6rR8hVRHV245rNSa0N0ST"
  		config.access_token_secret = "m96nlSAT5BRyxbk3oXR8Pef49lQINiWk4Yr9O3a2ughpJ"
	end
	topics = ["Aborto", "AbortoLegal", "SíAlAborto", "YoDecido", "ProAborto", "abortoChile", "AbortoTerapéutico", "AbortoTerapéuticoYA", "NoAlAborto", 			  "MarchaPorLaVida", "SíALaVida", "Noalaborto"]
	#topics2 = ["Batman", "USA", "Hola"]
	contador = 0
	@tweets = []
	#a = ["perro","batman"]
	topics.each do |i|
		client.search(i, :result_type => "recent").take(2).collect do |object|
			if object != nil
				contador += 1
				puts object.text if object.is_a?(Twitter::Tweet)
		  		puts contador
				@tweets.push contador

SELECT  "tweets".* FROM "tweets"  WHERE "tweets"."id_tweet" = '543820937527693312' LIMIT 1
SELECT "hastags".* FROM "hastags"
---
		});

##HASHTAGGGG
aux_tweet = Tweet.find_by_id_tweet(object.id.to_s)
		hash = Hastag.all

SELECT  "hastags".* FROM "hastags"  WHERE "hastags"."etiqueta" = 'abortoLegal' LIMIT 1
---
                puts aux.include?hastag.text.downcase
               puts"######################################################"
		if aux.include?hastag.text.downcase
                   tag=Hastag.find_by_etiqueta(x.etiqueta)

SELECT  "usuarios".* FROM "usuarios"  WHERE "usuarios"."id_usuario" = '842267617' LIMIT 1
SELECT  1 AS one FROM "usuarios"  WHERE "usuarios"."id_usuario" = '1347695197' LIMIT 1
INSERT INTO "usuarios" ("contador_seguidores", "created_at", "descripcion", "id_usuario", "nick", "nombre", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---



if Usuario.exists?(:id_usuario => object.user.id.to_s)== true

aux_usuario=Usuario.find_by_id_usuario(object.user.id.to_s)
aux_usuario.tweets << @tweet